import React from 'react'

export default function Page() {
	return (
		<section>
			<h2 className='text-2xl font-bold'>Experience</h2>
			<ul className='flex flex-col items-center gap-4'>
				<li>
					<h2 className='text-2xl font-bold'>Верстка та створення компонентів</h2>
					“Піксель-перфект верстка з розумним поділом на повторно використовувані компоненти, уникаючи надто складних компонентів із безліччю умов, що ускладнюють читання коду.”

📌 Ключові принципи:
	1.	Компоненти мають бути атомарними (розбиті на дрібні частини, які легко комбінуються).
	2.	Жодних “Годзілла-компонентів” (компонент не повинен містити сотні умов і ставати важким для розуміння).
	3.	Оптимальний баланс між DRY (Don’t Repeat Yourself) та читабельністю.
	4.	Простота пропсів – якщо компонент приймає забагато параметрів, можливо, варто його розбити на окремі частини.
	5.	Чітка відповідальність – кожен компонент має виконувати одну конкретну задачу.
				</li>
				<li>

				</li>
			</ul>
		</section>
	)
}
