import { Fragment } from 'react'

export function UKDescription() {
	return (
		<Fragment>
			<p className='mb-3'>
				Отримавши диплом у сфері{' '}
				<span className='font-medium'>
					будівництва та управління будівельними проектами
				</span>
				, я вирішив слідувати своїй пристрасті до програмування. Я записався на
				кілька курсів з програмування та поринув у{' '}
				<span className='font-medium'>full-stack веб-розробку</span>.{' '}
				<span className='italic'>Моя улюблена частина програмування</span> — це
				вирішення задач, зокрема структурований підхід до їх розв'язання. Я{' '}
				<span className='underline'>обожнюю</span> відчуття, коли нарешті
				знаходжу вирішення проблеми. Мій основний стек включає{' '}
				<span className='font-medium'>
					React, Next.js та Headless WordPress
				</span>
				. Також я знайомий із TypeScript і Prisma. Я завжди прагну вивчати нові
				технології. Наразі я шукаю{' '}
				<span className='font-medium'>постійну позицію</span> як розробник
				програмного забезпечення.
			</p>

			<p>
				<span className='italic'>Коли я не програмую</span>, я розмірковую про
				сенс життя та насолоджуюсь спогляданням краєвидів через вікно.{' '}
				<span className='font-medium'>Я також люблю здобувати нові знання</span>
				. На даний момент я вивчаю{' '}
				<span className='font-medium'>
					впровадження корисних звичок та систему Канбан
				</span>
				. Крім того, я маю сильну схильність до стандартизації для максимальної
				продуктивності в усіх аспектах.
			</p>

			<p>
				Є розуміння, що неможливо вивчити та запам'ятати все. Ідея полягає в
				тому, щоб отримати певне уявлення про використання тих чи інших
				інструментів, зрозуміти архітектуру розробки та набути особливого вміння
				швидко вирішувати проблеми стандартизованим способом. Головне —
				стандартизувати та покращувати ефективність усіх процесів.
			</p>
		</Fragment>
	)
}
